DataProcessors/ЦВ_ПерегенерацияНаименований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ЦВ_ПерегенерацияНаименований</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСодержит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Строки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БылоУкр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СталоУкр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БылоРус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СталоРус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменилось</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предупреждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЦВ_ПерегенерацияНаименований/Ext/ObjectModule.bsl
// Пакетная перегенерация наименований номенклатуры по шаблонам.
//
// Вся логика живёт в модуле менеджера Справочники.Номенклатура - здесь только связка
// с формой, чтобы кнопки формы вызывали ровно тот же код, что и карточка номенклатуры.
//
// Форма управляемая (Forms/Форма), её модуль только переключает клиент/сервер:
// каждая кнопка вызывает одноимённую экспортную процедуру отсюда.
// Пометки строк ставит сам модуль формы, на клиенте - гонять таблицу на сервер ради галочек незачем.

// Заполняет таблицу предпросмотра. НИЧЕГО не записывает.
Процедура ЗаполнитьПредпросмотр() Экспорт
             
	Строки.Очистить();

	ТекстСообщения = "";
	ТаблицаПредпросмотра = Справочники.Номенклатура.ПодготовитьПерегенерациюНаименований(
		ВидНоменклатуры, СокрЛП(НаименованиеСодержит), МаксСтрок, ТекстСообщения);

	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
		Сообщить(ТекстСообщения);
	КонецЕсли;

	Строки.Загрузить(ТаблицаПредпросмотра);

	КоличествоКИзменению   = 0;
	КоличествоСПредупрежд  = 0;
	Для Каждого СтрокаТаблицы Из Строки Цикл
		Если СтрокаТаблицы.Изменилось Тогда
			КоличествоКИзменению = КоличествоКИзменению + 1;
		КонецЕсли;
		Если НЕ ПустаяСтрока(СтрокаТаблицы.Предупреждения) Тогда
			КоличествоСПредупрежд = КоличествоСПредупрежд + 1;
		КонецЕсли;
	КонецЦикла;

	Сообщить("Знайдено позицій: " + Строки.Количество()
		+ ", змінюється: " + КоличествоКИзменению
		+ ", з попередженнями: " + КоличествоСПредупрежд
		+ ". Нічого не записано.");

КонецПроцедуры // ЗаполнитьПредпросмотр()

// Записывает отмеченные строки. Позиции, у которых новое имя длиннее допустимого,
// пропускаются - платформа обрезала бы его молча.
Процедура ЗаписатьОтмеченные() Экспорт

	Если Строки.Количество() = 0 Тогда
		Сообщить("Спочатку заповніть перегляд.");
		Возврат;
	КонецЕсли;

	Результат = Справочники.Номенклатура.ЗаписатьПерегенерированныеНаименования(Строки, СокрЛП(Комментарий));

	Сообщить("Записано: " + Результат.Записано + ", пропущено: " + Результат.Пропущено + ".");
	Для Каждого ТекстОшибки Из Результат.Ошибки Цикл
		Сообщить("   " + ТекстОшибки);
	КонецЦикла;

	Если ВыгружатьНаСайт И Результат.Записано > 0 Тогда
		ВыгрузитьМассивНаСайт(Результат.МассивЗаписанных);
	КонецЕсли;

	ЗаполнитьПредпросмотр();

КонецПроцедуры // ЗаписатьОтмеченные()

// Возвращает отмеченным позициям предыдущие наименования из истории.
Процедура ОткатитьОтмеченные() Экспорт

	МассивНоменклатуры = ОтмеченнаяНоменклатура();
	Если МассивНоменклатуры.Количество() = 0 Тогда
		Сообщить("Не позначено жодного рядка.");
		Возврат;
	КонецЕсли;

	Результат = Справочники.Номенклатура.ОткатитьНаименования(МассивНоменклатуры);

	Сообщить("Відкочено: " + Результат.Откачено + ".");
	Для Каждого ТекстОшибки Из Результат.Ошибки Цикл
		Сообщить("   " + ТекстОшибки);
	КонецЦикла;

	Если ВыгружатьНаСайт И Результат.Откачено > 0 Тогда
		ВыгрузитьМассивНаСайт(Результат.МассивОткаченных);
	КонецЕсли;

	ЗаполнитьПредпросмотр();

КонецПроцедуры // ОткатитьОтмеченные()

Процедура ВыгрузитьОтмеченныеНаСайт() Экспорт

	МассивНоменклатуры = ОтмеченнаяНоменклатура();
	Если МассивНоменклатуры.Количество() = 0 Тогда
		Сообщить("Не позначено жодного рядка.");
		Возврат;
	КонецЕсли;

	ВыгрузитьМассивНаСайт(МассивНоменклатуры);

КонецПроцедуры // ВыгрузитьОтмеченныеНаСайт()

Функция ОтмеченнаяНоменклатура()

	Результат = Новый Массив;
	Для Каждого СтрокаТаблицы Из Строки Цикл
		Если СтрокаТаблицы.Пометка Тогда
			Результат.Добавить(СтрокаТаблицы.Номенклатура);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции // ОтмеченнаяНоменклатура()

Процедура ВыгрузитьМассивНаСайт(МассивНоменклатуры)

	БП_ОбменMagentoВФоне.ВыгрузитьМассивНоменклатурыНаСайт(МассивНоменклатуры, "MagentoID");
	БП_ОбменMagentoВФоне.ВыгрузитьМассивНоменклатурыНаСайт(МассивНоменклатуры, "MagentoGarazhID");

	Сообщить("Відправлено на сайт пакетами: " + МассивНоменклатуры.Количество() + " позицій.");

КонецПроцедуры // ВыгрузитьМассивНаСайт()
